# Googling how to do something is NOT cheating. 
# Googling how to do figure something out is ENCOURAGED.

## #1 Figure out how to print the current date and time. 
The solution should be in this format:  2021-08-05 11:56:30 (YYYY-MM-DD HH:MM:SS)

Hint:  You're going to have to import a library

In [50]:
from datetime import datetime

currentTime = datetime.now()
print(f'The current time is: {currentTime.strftime("%Y-%m-%d %H:%M:%S")}')

# Alternate Option
print(f'Today is {currentTime.strftime("%A, %b %d, %Y")} and the current time is {currentTime.strftime("%I:%M %p")}')

The current time is: 2025-08-07 10:19:41
Today is Thursday, Aug 07, 2025 and the current time is 10:19 AM

Here’s a list of common `strftime` format codes for future reference:

- `%Y`: 4-digit year (e.g., 2025)
- `%y`: 2-digit year (e.g., 25)
- `%m`: 2-digit month (01-12)
- `%B`: Full month name (e.g., August)
- `%b`: Abbreviated month name (e.g., Aug)
- `%d`: Day of the month (01-31)
- `%-d`: Day of the month (1-31, no leading zero; not on Windows)
- `%A`: Full weekday name (e.g., Tuesday)
- `%a`: Abbreviated weekday name (e.g., Tue)
- `%H`: Hour (00-23, 24-hour clock)
- `%I`: Hour (01-12, 12-hour clock)
- `%p`: AM or PM
- `%M`: Minute (00-59)
- `%S`: Second (00-59)
- `%f`: Microsecond (000000-999999)
- `%z`: UTC offset (e.g., +0000)
- `%Z`: Time zone name
- `%j`: Day of the year (001-366)
- `%U`: Week number of the year (Sunday as first day, 00-53)
- `%W`: Week number of the year (Monday as first day, 00-53)
- `%c`: Locale’s date and time (e.g., Tue Aug 5 14:30:00 2025)
- `%x`: Locale’s date (e.g., 08/05/25)
- `%X`: Locale’s time (e.g., 14:30:00)
- `%%`: A literal '%' character

## #2 Write a function that accepts the radius of a circle and returns the area of a circle.  
The function for the area of a circle is pi * radius squared.

In [51]:
import math

def calculate_area_of_circle(radius):
    return math.pi*(radius**2)

radius = int(input(f'Enter the radius of the circle (in meters): '))
print(f'The area of a circle with radius {radius}m is {calculate_area_of_circle(radius):.2f}m²')

The area of a circle with radius 14m is 615.75m²

## #3 Write a function that takes a list of numbers and returns True if all number in the list are unique and returns False if the list contains duplicate numbers. 
* Hint, maybe think of using a set()

Input:  input_list = [2,4,5,5,7,9]

Expected Output:  False

In [52]:
def is_unique_list(numList):
    return len(set(numList)) == len(numList)

numListColumn = [
    [7, 3, 4, 4, 3],
    [1, 2, 3, 4, 5],
    [0, 2, 1, 7, 9],
    [3, 5, 1, 2, 1],
    []
]

for numList in numListColumn:
    if not numList:
        print(f'This List is Empty!')
    else:
        print(f'✅ NumList: {numList}  is a unique list' if is_unique_list(numList) else f'❌ NumList: {numList} is NOT a unique list')

❌ NumList: [7, 3, 4, 4, 3] is NOT a unique list
✅ NumList: [1, 2, 3, 4, 5]  is a unique list
✅ NumList: [0, 2, 1, 7, 9]  is a unique list
❌ NumList: [3, 5, 1, 2, 1] is NOT a unique list
This List is Empty!

## #4 Write a Python program to count the number of each character of a given text of a text file.
* Use the text file called 'lil-wayne.txt' in the data folder.  
* Convert all the characters to uppercase first, then count them.  
* Use a dictionary in which the keys of the dictionary are the characters, and the values are the counts of that character. 

Expected Result:  `{'D': 74, 'W': 63, 'A': 211, 'Y': 44, 'N': 165, 'E': 274, ' ': 522, 'M': 77, 'I': 185, 'C': 60, 'H': 122, 'L': 126, 'R': 152, 'T': 180, 'J': 8, '.': 26, '(': 12, 'B': 59, 'O': 145, 'S': 152, 'P': 39, '2': 24, '7': 7, ',': 37, '1': 28, '9': 16, '8': 6, ')': 12, '[': 14, ']': 14, 'K': 13, 'F': 44, 'G': 53, 'X': 5, 'U': 66, 'V': 20, '3': 2, '4': 4, '5': 5, '6': 3, '0': 36, '\n': 6, '-': 6, ';': 1, '!': 1, '"': 8, "'": 3, '—': 1}`

In [53]:
from collections import Counter

with open('../Week-03/intermediate/data/lil-wayne.txt', 'r') as file:
    text = file.read().upper()
    filtered_text = ''.join(char for char in text if char.isalpha())
    letterDict = Counter(filtered_text)


print(letterDict)

# Alternatively:
# letterDict = dict()
# with open('../Week-03/intermediate/data/lil-wayne.txt', 'r') as file:
#     text = file.read().upper()
#     for char in text:
#         if char.isalpha():
#             if char in letterDict:
#                 letterDict[char] += 1:
#             else:
#                 letterDict[char] = 1

# print(letterDict)

Counter({'E': 274, 'A': 211, 'I': 185, 'T': 180, 'N': 165, 'R': 152, 'S': 152, 'O': 145, 'L': 126, 'H': 122, 'M': 77, 'D': 74, 'U': 66, 'W': 63, 'C': 60, 'B': 59, 'G': 53, 'Y': 44, 'F': 44, 'P': 39, 'V': 20, 'K': 13, 'J': 8, 'X': 5})

# 4.5 Figure out how to sort the dictionary to find which character appears the most.

In [6]:
most_prevalent = sorted(letterDict.items(), key=lambda item: item[1], reverse=True)[0]
print(f'The most prevalent character is: {most_prevalent[0]} with {most_prevalent[1]} appearances')

The most prevalent character is: E with 274 appearances

## #5 Using the list below...
* Remove the fourth number from the list.
* Take that number you just removed and multiply the last number of the list by that number. 
* Append that number to the end of the list.
* Print the list

INPUT: [1, 1, 2, 3, 5, 8, 13, 21]

EXPECTED OUTPUT:  [1, 1, 2, 5, 8, 13, 21, 63]

In [7]:
list1 = [1, 1, 2, 3, 5, 8, 13, 21]
list1.append(list1[-1]*list1.pop(3))
print(list1)

[1, 1, 2, 5, 8, 13, 21, 63]

## #6 Using the list below, make a new list that contains only the numbers from the original list that are divisible by three.

* Input:  original_list = [2, 3, 6, 8, 9, 15, 19, 21]
* Expected new list:  [3, 6, 9, 15, 21]

In [8]:
original_list = [2, 3, 6, 8, 9, 15, 19, 21]
factors_of_3 = [num for num in original_list if num%3 == 0]
print(factors_of_3)

[3, 6, 9, 15, 21]

## #7 Reverse the list below

In [9]:
original_list = [2, 3, 6, 8, 9, 15, 19, 21]
reversed_list = original_list[::-1]
print(reversed_list)

[21, 19, 15, 9, 8, 6, 3, 2]

## #8 Using the list below, turn every item of the list into its square.  
* Input original_list = [1, 2, 3, 4, 5, 6, 7]
* Expected new_list:  [1, 4, 9, 16, 25, 36, 49]

In [10]:
original_list = [1, 2, 3, 4, 5, 6, 7]
squared_list = [num**2 for num in original_list]
print(squared_list)

[1, 4, 9, 16, 25, 36, 49]

## #9  Given a two Python list. Iterate both lists simultaneously such that list1 should display item in original order and list2 in reverse order.
Given input:
```
list1 = [10, 20, 30, 40]
list2 = [100, 200, 300, 400]
```

Expected Output:
```
10 400
20 300
30 200
40 100
```

In [11]:
list1 = [10, 20, 30, 40]
list2 = [100, 200, 300, 400]

for item1, item2 in zip(list1, list2[::-1]):
    print(item1, item2)

10 400
20 300
30 200
40 100

## #10 Remove empty strings from the list of strings.
Input:  `list_of_strings = ['I', 'love', '', '', 'data', '', 'science', '!']`

Expected Output:  `['I', 'love', 'data', 'science', '!']`

In [12]:
list_of_strings = ['I', 'love', '', '', 'data', '', 'science', '!']
print(list(filter(None, list_of_strings))) 

# Alternatively:
# print([s for s in list_of_strings if s])

['I', 'love', 'data', 'science', '!']

##  #11 Check if the value 999 exists in the dicitionary below.  If so, print true, if not print false.

Input: sample_dict = {'a': 100, 'b': 999, 'c': 300}

Expected Output:  True

In [13]:
sample_dict = {'a': 100, 'b': 999, 'c': 300}

print(999 in sample_dict.values())

True

# #12 Fix all the follow broken code snippets below
(I got these examples from a great website, I will reference them later because they have the answers on them.)

In [14]:
greeting = "Hello, possible pirate! What's the password?"
password = 'admin'
message = greeting+password
if message in ["Arrr!"]:
	print("Go away, pirate.")
else:
	print("Greetings, hater of pirates!")

Greetings, hater of pirates!

In [54]:
pages = 457
word_per_page = 250
number_of_pieces = 100

each_chunk = (457 * 250)/100
print(each_chunk)

1142.5

# Extra Credit

## Using pandas, read the csv file in the data folder called `titianic.csv` and store it as a variable named `df`.

In [24]:
import pandas as pd
df = pd.read_csv('../Week-03/intermediate/data/titanic.csv')

df

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## I know we didn't cover this, but figure out how to find the mean age of the age column in your dataframe.

In [23]:
mean_age = df["age"].mean()
print(f'The mean age is: {mean_age:.2f}')

The mean age is: 29.70

## What was the oldest and youngest ages on the titanic?

In [ ]:
youngest = df["age"].min()
youngest_person = df[df["age"] == youngest]["name"].tolist()
oldest = df["age"].max()
oldest_person = df[df["age"] == oldest]["name"].tolist()

# Fun exercise, lets do string editing to make the names more natural
def naturalize_name(name):
    if ',' in name:
        surname, givenNames = name.split(',', 1) # First we'll split the name on the first instance of the comma
        givenNames = givenNames.strip() # Then I'll remove whitespaces from around the given names
        givenNames = givenNames.split() # Then split the given names into a list containing each name 
        # Just a side note, reassigning givenNames to givenNames.split() actually mutates this variable
        #  from a string to a list therefore string methods will no longer work

        # We'll check if the names contain titles, in this case, they all do, but it helps to be thorough
        if givenNames and givenNames[0].endswith('.'):  
            # Separate the title
            title = givenNames[0]
            # Join the first and middle names together into a single string, we'll join each with a space
            firstAndMiddleNames = ' '.join(givenNames[1:])
            # Then return a string with the format we wanted, Title, first name, middle names and surname while removing any whitespace around the variable
            return f"{title} {firstAndMiddleNames} {surname}".strip()
        else:
            # If there's no title (no '.' present) then we return a formatted string with the first name, middle names and surname
            return f"{givenNames} {surname}".strip()
        
    # Otherwise if theres no ',' (which usually represents a malformed name or an empty string) then we just return the string exactly as we got it
    return name

# Long way of doing this:
if len(oldest_person) > 1:
    print(f'The oldest passengers are: {", ".join([naturalize_name(name) for name in oldest_person])} at {oldest} years old')   
elif len(oldest_person) == 1:
    print(f'The oldest passenger is: {naturalize_name(oldest_person[0])} at {oldest} years old')
if len(youngest_person) > 1:
    print(f'The youngest passengers are: {", ".join([naturalize_name(name) for name in youngest_person])} at {youngest} years old')
elif len(youngest_person) == 1:
    print(f'The youngest passenger is: {naturalize_name(youngest_person[0])} at {youngest} years old')
else:
    print(f'There are no passengers aboard')

The oldest passenger is: Mr. Algernon Henry Wilson Barkworth at 80.0 years old
The youngest passenger is: Master. Assad Alexander Thomas at 0.42 years old

In [25]:
# Alternative Option:
# Apply the function to the name column to format the column in my prefered style

df["name"] = df["name"].apply(naturalize_name)
df

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,Mr. Owen Harris Braund,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Miss. Laina Heikkinen,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Mr. William Henry Allen,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Rev. Juozas Montvila,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Miss. Catherine Helen ""Carrie"" Johnston",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,Mr. Karl Howell Behr,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,Mr. Patrick Dooley,male,32.0,0,0,370376,7.7500,NaN,Q

## How many people embarked from station 'S'?

In [45]:
print(f'{len(df[df["embarked"] == "S"])} passengers embarked at Station S')

644 passengers embarked at Station S

In [ ]:
# Lets go a step further, and find the number of people that embarked from each station

# Group the rows by each unique value in the embarked column, then counts the number of rows per group
# df.groupby("embarked").size()

# Or Simply count the occurrences of each unique value in the "embarked" column
# df["embarked"].value_counts()

# Now lets format it into a proper output
for station, count_of_passengers in df["embarked"].value_counts().items():
    print(f'{count_of_passengers} embarked at Station {station}')

# Here's a breakdown:
# As stated above, .value_counts() counts the occurrences of each unique value in the "embarked" column
# We can then iterate over the Series that was created from .value_counts using .items() 
# as (key/index, value) pairs...a dictionary if you will
# After that its just a matter of manipulating the dictionary as needed

644 embarked at Station S
168 embarked at Station C
77 embarked at Station Q